CSI API ETABS v1
eNamedSetType Enumeration
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public enum eNamedSetType
Public Enumeration eNamedSetType
Dim instance As eNamedSetType
public enum class eNamedSetType
type eNamedSetType
Members
Member name | Value | Description
All | 0
UpdateBridgeObject | 1
RunAnalysis | 2
RunBridgeDesignSuperstructure | 3
RunBridgeDesignSubstructure | 4
RunBridgeDesignSeismic | 5
RunBridgeRatingSuperstructure | 6
RunMemberRating | 7
JointTHResponseSpectra | 8
NamedDisplay | 9
PlotFunctionTraces | 10
PushoverCurve | 11
VirtualWork | 12
TableSet | 13
TableGroupSuperset | 14
BridgeSeismicReport | 15
BridgeSuperstructureResponse | 16
BridgeCalculationReport | 17
BridgeCalculationReportSub | 18
See Also
Reference
ETABSv1 Namespace